---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArray.Append(Autodesk.Revit.DB.Reference)
source: html/be1dcca0-3e35-1d0d-7bd1-4cfbcf0ed985.htm
---
# Autodesk.Revit.DB.ReferenceArray.Append Method

Add the reference to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	Reference item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Reference`) - The reference to be added.